{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Collection of short summaries describing each frontend file’s purpose.",
  "frontend/index.css": "Tailwind base/theme variables and global styles for light/dark modes and romantic color tokens.",
  "frontend/index.html": "HTML entry point setting title, favicon, and root mount point.",
  "frontend/src/App.tsx": "App root that renders the ValentineInvitePage component.",
  "frontend/src/components/CtaRow.tsx": "CTA row with animated Yes/No buttons using shadcn UI.",
  "frontend/src/components/LetterCard.tsx": "Animated letter component revealing a long Valentine message line by line.",
  "frontend/src/components/MemoriesMontageScene.tsx": "Empty file placeholder for removed montage scene.",
  "frontend/src/components/OutcomeScene.tsx": "Outcome screen showing Yes/No responses with animations and reset/continue actions.",
  "frontend/src/components/ProposalScene.tsx": "Proposal flow component handling yes/thinking states with animated feedback and reset option.",
  "frontend/src/components/ValentineInvitePage.tsx": "Main page component managing scene transitions, loading animations, and rendering letter, outcomes, and proposal views.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user’s Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and context for storing and restoring identities.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that detects and updates whether the user prefers reduced motion via a media query listener.",
  "frontend/src/index.css": "Tailwind base and custom romantic theme variables plus component styles for the Valentine UI.",
  "frontend/src/main.tsx": "App entry point setting up React, query client provider, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, containers, animations, and custom romantic theme tokens.",
  "project_state.json": "Project metadata describing features, scope, issues, and current state for the Valentine invitation experience."
}